Enums/ВидыОграниченияПособия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОграниченияПособия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщееОграничение</Name>
					<Comment>АПК:58</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОграничениеВРазмереММОТ</Name>
					<Comment>АПК:58</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезОграничений</Name>
					<Comment>АПК:58</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимальныйРазмерЕжемесячнойСтраховойВыплаты</Name>
					<Comment>АПК:58</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОграниченияПособия/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
		
	// ЗУПК
	СписокИсключений = Новый Массив;
	СписокИсключений.Добавить(Перечисления.ВидыОграниченияПособия.ОграничениеВРазмереММОТ);
	СписокИсключений.Добавить(Перечисления.ВидыОграниченияПособия.МаксимальныйРазмерЕжемесячнойСтраховойВыплаты);
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Для Каждого ЗначениеПеречисления Из Перечисления.ВидыОграниченияПособия Цикл
		Если СписокИсключений.Найти(ЗначениеПеречисления) = Неопределено Тогда
			ДанныеВыбора.Добавить(ЗначениеПеречисления);
		КонецЕсли;
	КонецЦикла;
	
	СтандартнаяОбработка = Ложь;
	// ЗУПК
	
	РасчетЗарплатыКлиентСервер.ОбработкаПолученияДанныхВыбораВидовОграниченияПособия(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
